app/controllers/api/listings_controller.rb

SELECT "listings".* FROM "listings"
---
    def index
        @listings = Listings.all