app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)